INSERT INTO `store`(`store_area`, `operating_hours`, `street`, `number`, `zip`, `city`, `phone_number`) VALUES
('230', '8:00 - 20:00', 'Λεωφόρος Παπάγου', '28', '15773', 'Αθήνα', '2103477845'),
('500','8:00 - 20:00', 'Κειριαδών', '53', '11853', 'Αθήνα', '2103474744'),
('669','8:00 - 20:00', 'Ροδοπόλεως', '57', '18451', 'Αθήνα', '2100151569'),
('1000','8:00 - 20:00', 'Τσιμισκή', '45', '11515', 'Θεσσαλονίκη', '2310556698'),
('600','8:00 - 20:00', 'Αρμάτων', '92', '24196', 'Θεσσαλονίκη', '2542315166'),
('420','8:00 - 20:00', 'Αντικυθήρων', '69', '98444', 'Αθήνα', '2103558897'),
('830','8:00 - 20:00', 'Νεροκούρου', '7', '32608', 'Βέροια', '2222522555'),
('430','8:00 - 20:00', 'Λαλαούνη', '42', '75886', 'Βέροια', '2156416555'),
('700','8:00 - 20:00', 'Αλέας', '1', '64844', "Θεσσαλονίκη", '2310542098'),
('666','8:00 - 20:00', 'Πλατεία Καμενίτσης', '85', '40633', 'Αθήνα', '2107723393')
