-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: May 19, 2020 at 05:54 PM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `supermarkets`
--

-- --------------------------------------------------------

--
-- Table structure for table `at`
--

CREATE TABLE `at` (
  `store_id` int(11) NOT NULL,
  `transaction_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `contains`
--

CREATE TABLE `contains` (
  `product_id` int(11) NOT NULL,
  `transaction_id` int(11) NOT NULL,
  `quantity_bought` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `customer`
--

CREATE TABLE `customer` (
  `card_id` int(11) NOT NULL,
  `first_name` varchar(30) NOT NULL,
  `middle_name` varchar(30) DEFAULT NULL,
  `last_name` varchar(30) NOT NULL,
  `street` varchar(50) NOT NULL,
  `number` varchar(10) NOT NULL,
  `zip` varchar(10) NOT NULL,
  `city` varchar(50) NOT NULL,
  `birth_date` date NOT NULL,
  `relationship_status` varchar(50) DEFAULT NULL,
  `nr_kids` tinyint(3) UNSIGNED DEFAULT NULL,
  `gender` varchar(10) NOT NULL,
  `phone_number` text NOT NULL,
  `points` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `customer`
--

INSERT INTO `customer` (`card_id`, `first_name`, `middle_name`, `last_name`, `street`, `number`, `zip`, `city`, `birth_date`, `relationship_status`, `nr_kids`, `gender`, `phone_number`, `points`) VALUES
(1, 'Μεταξία', NULL, 'Κολαΐτου', 'Μολόχας', '37', '13352', 'Θεσσαλονίκη', '1948-04-25', 'χωρισμένος', 0, 'Γυναίκα', '6972090489', 2337),
(2, 'Εύα', NULL, 'Παπαδημητροπούλου', 'Αραχόβης', '126-902', '68279', 'Αθήνα', '1990-09-13', 'ελεύθερος', 0, 'Γυναίκα', '6976363498', 6602),
(3, 'Παρασκευάς', 'Δίκαιος', 'Αργυρής', 'Σκληρού', '91-35', '28266', 'Αθήνα', '1948-01-10', 'χωρισμένος', 2, 'Αντρας', '6974276065', 6631),
(4, 'Εύα', NULL, 'Σελινοπούλου', 'Οξυάς', '3', '43094', 'Βέροια', '1999-11-22', 'ελεύθερος', 0, 'Γυναίκα', '6978448701', 9258),
(5, 'Αμβρόσιος', NULL, 'Κουκουλιάντας', 'Λεωφ. Τριπύλας', '680-967', '44763', 'Αθήνα', '1967-08-01', 'χωρισμένος', 4, 'Αντρας', '6975968819', 1258),
(6, 'Βασίλης', NULL, 'Ανδριανός', 'Καλεντζίου', '251', '95264', 'Θεσσαλονίκη', '1966-11-06', 'ελεύθερος', 0, 'Αντρας', '6974138165', 9280),
(7, 'Αιμιλιανός', 'Θεμιστοκλής', 'Καλαϊτζάκης', 'Καρουτών', '57', '17006', 'Θεσσαλονίκη', '1950-07-23', 'παντρεμένος', 3, 'Αντρας', '6970973380', 7838),
(8, 'Σταμάτιος', NULL, 'Πανταζής', 'Μικρού Μοναστηρίου', '520-880', '79383', 'Βέροια', '1987-09-06', 'χωρισμένος', 5, 'Αντρας', '6975187362', 1707),
(9, 'Ναταλίνα', NULL, 'Κονιάρη', 'Πεμούση', '45', '84158', 'Αθήνα', '1977-07-13', 'παντρεμένος', 6, 'Γυναίκα', '6971786450', 3580),
(10, 'Χαρά', NULL, 'Μητροπούλου', 'Καλυβίων Μυρτουντίων', '683-479', '66540', 'Βέροια', '1931-05-10', 'χωρισμένος', 4, 'Γυναίκα', '6970654942', 3684),
(11, 'Τριανταφυλλιά', NULL, 'Μπραέσα', 'Μαργαριτάκη', '766', '69603', 'Αθήνα', '1947-03-21', 'παντρεμένος', 2, 'Γυναίκα', '6978343903', 5009),
(12, 'Παναγιώτης', NULL, 'Μπαλτζής', 'Φλωρίνης', '75-36', '46645', 'Βέροια', '1957-03-01', 'παντρεμένος', 1, 'Αντρας', '6975070833', 6971),
(13, 'Νέαρχος', NULL, 'Εσπερίδης', 'Πελλάνας', '212', '30656', 'Αθήνα', '1941-04-14', 'παντρεμένος', 6, 'Αντρας', '6977659622', 7217),
(14, 'Πολύμνια', NULL, 'Τρομπούκη', 'Γκούβα', '6', '65862', 'Αθήνα', '1934-11-12', 'ελεύθερος', 0, 'Γυναίκα', '6979559991', 3475),
(15, 'Αγόρω', 'Ηώ', 'Γραμμένου', 'Λεχόβου', '85', '14539', 'Βέροια', '1940-10-29', 'χωρισμένος', 1, 'Γυναίκα', '6976406164', 4571),
(16, 'Λασκαρίνα', 'Χρυσούλα', 'Σολωμίδου', 'Τσικνή', '260', '34467', 'Θεσσαλονίκη', '1977-04-17', 'χωρισμένος', 6, 'Γυναίκα', '6976995773', 1392),
(17, 'Ρηγούλα', NULL, 'Ζαχαρίου', 'Προύβα', '27-42', '50735', 'Αθήνα', '1977-03-25', 'παντρεμένος', 0, 'Γυναίκα', '6970898469', 4227),
(18, 'Ευριπίδης', NULL, 'Κατσίφος', 'Πετρανών', '787', '87875', 'Θεσσαλονίκη', '1967-08-08', 'παντρεμένος', 2, 'Αντρας', '6971077253', 921),
(19, 'Εριέτα', NULL, 'Παπανδρέου', 'Βερμίου', '172-684', '30583', 'Βέροια', '1965-09-12', 'ελεύθερος', 0, 'Γυναίκα', '6977384304', 3908),
(20, 'Θέμης', NULL, 'Φωτογλίδης', 'Λεβαίας', '497', '23551', 'Βέροια', '1988-03-02', 'χωρισμένος', 2, 'Αντρας', '6975561395', 758),
(21, 'Ερωτόκριτος', NULL, 'Σταμόπουλος', 'Γρηγόρη', '5', '42692', 'Βέροια', '1944-03-01', 'χωρισμένος', 4, 'Αντρας', '6978438678', 5531),
(22, 'Αριστοφάνης', NULL, 'Γαβριδάκης', 'Δρακουλή', '3', '78554', 'Βέροια', '1965-11-18', 'ελεύθερος', 0, 'Αντρας', '6979531207', 468),
(23, 'Αλκινόη', NULL, 'Πάντζιου', 'Λεωφ. Σελιάνας', '947', '64810', 'Αθήνα', '1931-04-18', 'παντρεμένος', 6, 'Γυναίκα', '6976421433', 4738),
(24, 'Κρυστάλλης', 'Ανδροκλής', 'Θεολόγος', 'Καρδιτσομαγούλας', '33-46', '17320', 'Θεσσαλονίκη', '1941-04-12', 'χωρισμένος', 1, 'Αντρας', '6975751420', 7678),
(25, 'Φραντζέσκα', NULL, 'Βαγενά', 'Φιλιατών', '6', '56165', 'Βέροια', '1949-12-06', 'ελεύθερος', 0, 'Γυναίκα', '6970439198', 7463),
(26, 'Αλέξιος', NULL, 'Τσάρκος', 'Αροανίας', '912', '31768', 'Θεσσαλονίκη', '1930-07-01', 'χωρισμένος', 2, 'Αντρας', '6973528173', 9052),
(27, 'Μιλτιάδης', NULL, 'Λιθοξοΐδης', 'Κερκίνης', '751', '12016', 'Αθήνα', '1920-09-12', 'παντρεμένος', 1, 'Αντρας', '6979727489', 3512),
(28, 'Φωτεινή', 'Αρέθα', 'Σπανίδου', 'Κατσαρού', '5', '96903', 'Αθήνα', '1992-08-07', 'χωρισμένος', 4, 'Γυναίκα', '6972208774', 6623),
(29, 'Ανανίας', 'Παναγής', 'Σαμαράς', 'Γερακαρίου', '86', '98941', 'Βέροια', '1949-11-20', 'παντρεμένος', 4, 'Αντρας', '6972027983', 8223),
(30, 'Κλεόπας', NULL, 'Λιθοξοΐδης', 'Βραδή', '75', '97707', 'Θεσσαλονίκη', '1994-07-11', 'ελεύθερος', 0, 'Αντρας', '6977398031', 8128),
(31, 'Βαρσαμία', NULL, 'Πετσιά', 'Δρακείας', '42-36', '35308', 'Βέροια', '1976-02-01', 'χωρισμένος', 4, 'Γυναίκα', '6978038373', 5547),
(32, 'Ροδαμάνθη', NULL, 'Τζιγκούρα', 'Καλογριανών', '91', '72202', 'Θεσσαλονίκη', '1977-03-06', 'χωρισμένος', 1, 'Γυναίκα', '6975539764', 639),
(33, 'Κωνσταντίνος', NULL, 'Τεμουρτζίδης', 'Μωυσίδου', '70', '96411', 'Αθήνα', '1939-06-02', 'χωρισμένος', 2, 'Αντρας', '6973358775', 4320),
(34, 'Λυκούργος', NULL, 'Δέλιος', 'Περάμου', '59-20', '39025', 'Θεσσαλονίκη', '1973-11-16', 'χωρισμένος', 3, 'Αντρας', '6970927192', 7961),
(35, 'Άνθιμος', NULL, 'Βλησαρούλης', 'Αλωνισταίνης', '305', '26438', 'Βέροια', '1938-03-18', 'παντρεμένος', 5, 'Αντρας', '6971304761', 1643),
(36, 'Φραγκίσκος', NULL, 'Κωστίδης', 'Λεωφόρος Φλαμουριάς', '12', '99102', 'Θεσσαλονίκη', '1953-09-19', 'χωρισμένος', 2, 'Αντρας', '6972887083', 2352),
(37, 'Δημοκράτης', NULL, 'Μαυρικάκης', 'Μεσονησίου', '27', '86286', 'Αθήνα', '1958-09-21', 'χωρισμένος', 4, 'Αντρας', '6971048886', 1533),
(38, 'Βλάσιος', NULL, 'Σίδερης', 'Πέρνης', '45', '85442', 'Θεσσαλονίκη', '1945-03-29', 'χωρισμένος', 2, 'Αντρας', '6978275964', 9375),
(39, 'Υπαπαντή', NULL, 'Χριστοδούλου', 'Πλατεία Ρυσίου', '08', '37635', 'Θεσσαλονίκη', '1956-04-05', 'ελεύθερος', 0, 'Γυναίκα', '6977218986', 3923),
(40, 'Βύρων', NULL, 'Σαρίκας', 'Αγίων Παρασκιών', '157', '68179', 'Αθήνα', '1922-01-05', 'ελεύθερος', 0, 'Αντρας', '6973103115', 3114),
(41, 'Φραγκίσκος', NULL, 'Δημητρόπουλος', 'Μαρμάρων', '3', '61648', 'Αθήνα', '1954-04-01', 'χωρισμένος', 0, 'Αντρας', '6972335228', 1805),
(42, 'Θέτις', NULL, 'Πατσουρέα', 'Μυλωνίδου', '65-85', '84250', 'Αθήνα', '1933-01-03', 'παντρεμένος', 0, 'Γυναίκα', '6979121948', 8555),
(43, 'Μερόπη', NULL, 'Καχριμανίδη', 'Αντικύρας', '10', '47398', 'Βέροια', '1923-12-04', 'ελεύθερος', 0, 'Γυναίκα', '6975120211', 6982),
(44, 'Ευρυδίκη', NULL, 'Μπύρου', 'Περίου', '34-00', '79838', 'Αθήνα', '1941-12-06', 'ελεύθερος', 0, 'Γυναίκα', '6979158618', 8394),
(45, 'Ιορδάνης', NULL, 'Καφίρης', 'Βίνιανης', '4', '64919', 'Αθήνα', '1977-10-22', 'ελεύθερος', 0, 'Αντρας', '6975418661', 2867),
(46, 'Πολύδωρος', NULL, 'Παπαδάκης', 'Λεωφ. Παραλιμνίου', '29', '92298', 'Αθήνα', '1967-07-14', 'ελεύθερος', 0, 'Αντρας', '6974328481', 4539),
(47, 'Εριέτα', 'Κλαίρη', 'Σελινοπούλου', 'Βαθυτόπου', '894', '28761', 'Θεσσαλονίκη', '1945-12-14', 'παντρεμένος', 5, 'Γυναίκα', '6975220860', 4927),
(48, 'Αμβρόσιος', NULL, 'Καραμάνος', 'Σκρεμμύδα', '3', '14730', 'Θεσσαλονίκη', '1988-09-25', 'παντρεμένος', 4, 'Αντρας', '6977123219', 2677),
(49, 'Δανάη', 'Εύκλεια', 'Χατζηχαρίστου', 'Αιγίου', '1', '59879', 'Βέροια', '1960-02-23', 'ελεύθερος', 0, 'Γυναίκα', '6977940061', 2216),
(50, 'Σωφρονία', NULL, 'Χατζημιχαήλ', 'Πάροδος Πετριτσίου', '42', '51895', 'Αθήνα', '1964-07-08', 'χωρισμένος', 5, 'Γυναίκα', '6975154032', 3368),
(51, 'Θεοπίστη', NULL, 'Δούβαλη', 'Παγκρατίου', '3', '71439', 'Αθήνα', '1980-12-22', 'παντρεμένος', 1, 'Γυναίκα', '6978284570', 7856),
(52, 'Πουλχερία', NULL, 'Κοντογιάννη', 'Καρυοφύτου', '92', '10690', 'Αθήνα', '1960-03-10', 'παντρεμένος', 0, 'Γυναίκα', '6978836733', 3749),
(53, 'Ιουλιανός', NULL, 'Αξιώτης', 'Αγριάνων', '5', '19238', 'Βέροια', '1955-06-27', 'χωρισμένος', 4, 'Αντρας', '6979487876', 1897),
(54, 'Γαρύφαλλος', NULL, 'Ρουσιανός', 'Σιόλου', '71', '53992', 'Βέροια', '1959-01-18', 'χωρισμένος', 2, 'Αντρας', '6979506359', 9211),
(55, 'Στυλιανός', NULL, 'Παπαγεωργίου', 'Λογγάστρας', '95', '65424', 'Βέροια', '1996-03-27', 'παντρεμένος', 1, 'Αντρας', '6978619279', 2102),
(56, 'Θεοφανία', NULL, 'Λεπίδα', 'Εσωβάλτων', '81-50', '32258', 'Αθήνα', '1933-09-18', 'ελεύθερος', 0, 'Γυναίκα', '6979117787', 7867),
(57, 'Μενέλαος', NULL, 'Τσόλκας', 'Σωτηροπούλου', '791', '85227', 'Βέροια', '1970-12-20', 'ελεύθερος', 0, 'Αντρας', '6974303563', 9292),
(58, 'Ζηνόβιος', NULL, 'Σύκας', 'Λιπαρού', '78', '26108', 'Αθήνα', '1955-10-17', 'χωρισμένος', 3, 'Αντρας', '6977006750', 935),
(59, 'Χρυσόστομος', NULL, 'Χέλιος', 'Βαμβουκάκη', '333-202', '96707', 'Βέροια', '1971-07-29', 'χωρισμένος', 3, 'Αντρας', '6973599198', 4400),
(60, 'Ευρύκλεια', NULL, 'Στυλιανίδου', 'Δένδρων Φαρσάλων', '46', '89845', 'Βέροια', '1973-12-25', 'ελεύθερος', 0, 'Γυναίκα', '6971103832', 2401),
(61, 'Άριστος', NULL, 'Λιόλιος', 'Ματαράγκας', '14', '82234', 'Αθήνα', '1927-05-27', 'χωρισμένος', 3, 'Αντρας', '6973227376', 4574),
(62, 'Βαρδής', NULL, 'Ζουλούμης', 'Λεωφόρος Αχυρών', '4', '16167', 'Βέροια', '1955-04-24', 'παντρεμένος', 3, 'Αντρας', '6976963321', 1572),
(63, 'Ανδρόνικος', NULL, 'Τεμουρτζίδης', 'Παπανώτα', '29-00', '76521', 'Αθήνα', '2001-03-09', 'παντρεμένος', 2, 'Αντρας', '6977178486', 9865),
(64, 'Συμεωνία', 'Βικτόρια', 'Καραγρηγορίου', 'Πεζούλας', '34', '14056', 'Αθήνα', '1961-04-16', 'ελεύθερος', 0, 'Γυναίκα', '6971327887', 7431),
(65, 'Πανορμίτης', 'Θρασύβουλος', 'Ανδριώτης', 'Λεωφ. Κισσάμου', '12-92', '14514', 'Θεσσαλονίκη', '1941-07-24', 'ελεύθερος', 0, 'Αντρας', '6978898149', 7671),
(66, 'Κορνήλιος', NULL, 'Λαγγούσης', 'Λεωφόρος Νεγράδων', '37', '11257', 'Βέροια', '1933-04-14', 'χωρισμένος', 6, 'Αντρας', '6973783906', 4034),
(67, 'Παράσχος', NULL, 'Χαραλάμπους', 'Διχωρίου', '031-236', '81428', 'Αθήνα', '1993-09-26', 'ελεύθερος', 0, 'Αντρας', '6976044287', 5520),
(68, 'Γκόλφω', 'Φλωρεντία', 'Μιλέα', 'Σύψα', '731', '23353', 'Βέροια', '1948-11-14', 'παντρεμένος', 4, 'Γυναίκα', '6974862418', 5212),
(69, 'Αλίκη', NULL, 'Πολατίδου', 'Καταφυγίου', '29', '67433', 'Θεσσαλονίκη', '1932-10-01', 'ελεύθερος', 0, 'Γυναίκα', '6978415314', 339),
(70, 'Θεώνη', NULL, 'Ζαφείρη', 'Καριταίνης', '53', '12626', 'Θεσσαλονίκη', '1971-01-28', 'χωρισμένος', 2, 'Γυναίκα', '6972760343', 3061),
(71, 'Ροδόφλος', NULL, 'Μακρυκώστας', 'Λεωφόρος Κριθιάς', '094-703', '79231', 'Βέροια', '1987-12-15', 'παντρεμένος', 4, 'Αντρας', '6979091319', 1143),
(72, 'Ζηνόβιος', NULL, 'Βανδώρος', 'Αγριανής', '753', '76259', 'Βέροια', '1942-09-25', 'παντρεμένος', 2, 'Αντρας', '6975241316', 6718),
(73, 'Νεοκλής', NULL, 'Χριστόπουλος', 'Λεωφ. Σούρπης', '12', '86077', 'Βέροια', '1958-07-04', 'ελεύθερος', 0, 'Αντρας', '6975466508', 6610),
(74, 'Αστέρω', NULL, 'Βασιλείου', 'Μυλοτόπου', '021-745', '38885', 'Αθήνα', '1973-10-13', 'ελεύθερος', 0, 'Γυναίκα', '6974082643', 2015),
(75, 'Ξένη', 'Πούλια', 'Βλαχοδήμου', 'Πάροδος Αλεξανδρείας', '31-46', '29677', 'Αθήνα', '1930-05-10', 'ελεύθερος', 0, 'Γυναίκα', '6974164546', 4573),
(76, 'Σωτήριος', NULL, 'Χρυσικός', 'Σταροχωρίου', '42', '82234', 'Αθήνα', '1940-02-09', 'χωρισμένος', 6, 'Αντρας', '6973303582', 3775),
(77, 'Γερακίνα', NULL, 'Πέττα', 'Πλ. Ζηλευτού', '6', '76084', 'Βέροια', '1995-03-19', 'παντρεμένος', 2, 'Γυναίκα', '6974813253', 7691),
(78, 'Συμεών', 'Βλάσης', 'Ντόβας', 'Κίρρας', '39', '52300', 'Θεσσαλονίκη', '1966-03-18', 'χωρισμένος', 6, 'Αντρας', '6979818389', 2158),
(79, 'Λουκάς', NULL, 'Ανδρουλιδάκης', 'Κυρκούδη', '566-607', '47413', 'Βέροια', '1923-05-29', 'παντρεμένος', 0, 'Αντρας', '6971389044', 2040),
(80, 'Γενοβέφα', NULL, 'Μαρτζούκου', 'Μιχοΐου', '72-34', '49592', 'Βέροια', '1986-06-06', 'χωρισμένος', 6, 'Γυναίκα', '6977523975', 9610),
(81, 'Άνθιμος', NULL, 'Χουδαλάκης', 'Πλατεία Γκοριτσάς', '2', '37869', 'Βέροια', '1920-07-09', 'παντρεμένος', 0, 'Αντρας', '6977686852', 3521),
(82, 'Ευγενία', NULL, 'Γαλάνη', 'Λοφίσκου', '664-277', '96756', 'Αθήνα', '1984-10-09', 'παντρεμένος', 6, 'Γυναίκα', '6977194638', 8246),
(83, 'Σπυρίδων', NULL, 'Σμαρδάς', 'Χρυσοχωράφων', '0', '44527', 'Θεσσαλονίκη', '1936-04-09', 'χωρισμένος', 0, 'Αντρας', '6975989366', 4571),
(84, 'Βαλάντης', NULL, 'Ταχτσίδης', 'Κερπινής', '04', '13458', 'Θεσσαλονίκη', '1982-11-20', 'παντρεμένος', 2, 'Αντρας', '6970629904', 2193),
(85, 'Ευριπίδης', 'Ηρακλής', 'Ευαγγελάτος', 'Χατζή', '50', '64870', 'Αθήνα', '1995-10-02', 'παντρεμένος', 2, 'Αντρας', '6977675169', 5174),
(86, 'Ρίζος', 'Παναγής', 'Συλλίγαρδος', 'Λεωφ. Φραντζεσκιανών Μετοχίων', '4', '73719', 'Θεσσαλονίκη', '1997-05-06', 'ελεύθερος', 0, 'Αντρας', '6979067238', 1813),
(87, 'Μαριλένα', NULL, 'Τοπαλή', 'Πάροδος Αρχοντικής', '32-40', '10763', 'Θεσσαλονίκη', '1952-02-27', 'χωρισμένος', 2, 'Γυναίκα', '6972424174', 9236),
(88, 'Ηρόδοτος', NULL, 'Ταβερναράκης', 'Ρογών', '6', '98093', 'Βέροια', '1934-12-30', 'ελεύθερος', 0, 'Αντρας', '6974639022', 8988),
(89, 'Μιλτιάδης', NULL, 'Γιασημάκης', 'Πλ. Σταυρωμένου', '77', '12041', 'Θεσσαλονίκη', '1987-12-21', 'παντρεμένος', 5, 'Αντρας', '6978656885', 1580),
(90, 'Ασπασία', NULL, 'Φουρκιώτη', 'Πλ. Ιωνίας', '78', '79934', 'Αθήνα', '1926-04-29', 'χωρισμένος', 1, 'Γυναίκα', '6970051217', 9288),
(91, 'Πέτρα', NULL, 'Μπρούζου', 'Πάτμου', '574-578', '27123', 'Θεσσαλονίκη', '1929-11-15', 'παντρεμένος', 3, 'Γυναίκα', '6977269281', 750),
(92, 'Καρυοφυλλιά', NULL, 'Ταυλαρίδου', 'Γουμέρου', '703-173', '68382', 'Βέροια', '1921-07-12', 'ελεύθερος', 0, 'Γυναίκα', '6974062133', 2869),
(93, 'Χαράλαμπος', NULL, 'Γεωργακόπουλος', 'Γιαννιτσών', '217', '99053', 'Θεσσαλονίκη', '1985-12-15', 'χωρισμένος', 5, 'Αντρας', '6973081664', 8120),
(94, 'Βικτωρία', NULL, 'Κουτσικούρη', 'Σίββα', '77', '13153', 'Αθήνα', '1927-10-25', 'ελεύθερος', 0, 'Γυναίκα', '6973928591', 80),
(95, 'Χριστιάνα', NULL, 'Μαγκανάρη', 'Πυλωρών', '97', '55344', 'Βέροια', '1980-05-22', 'ελεύθερος', 0, 'Γυναίκα', '6979000786', 5778),
(96, 'Θεοδώρα', NULL, 'Δαμαλά', 'Πάρ. Νεροφράκτου', '580', '75661', 'Βέροια', '1956-06-15', 'ελεύθερος', 0, 'Γυναίκα', '6973466239', 4515),
(97, 'Ερμιόνη', NULL, 'Σακελλαρίου', 'Εδέσσης', '325-281', '42835', 'Βέροια', '1978-08-30', 'χωρισμένος', 4, 'Γυναίκα', '6970067267', 42),
(98, 'Γαλάτιος', NULL, 'Καρατζίκος', 'Πλ. Λιμνοχωρίου', '8', '57950', 'Θεσσαλονίκη', '1929-10-21', 'ελεύθερος', 0, 'Αντρας', '6971257359', 7590),
(99, 'Πέτρα', NULL, 'Καλέμη', 'Αγίου Γεωργίου Λασιθίου', '05-56', '72513', 'Θεσσαλονίκη', '1979-08-16', 'παντρεμένος', 1, 'Γυναίκα', '6972939833', 4490),
(100, 'Αγαπητός', NULL, 'Λαγογιάννης', 'Αστακού', '308', '29110', 'Βέροια', '1974-04-22', 'ελεύθερος', 0, 'Αντρας', '6974719911', 4190),
(101, 'Τρισεύγενη', NULL, 'Αθανασιάδου', 'Κανελλή', '680', '94941', 'Βέροια', '1950-07-04', 'παντρεμένος', 5, 'Γυναίκα', '6977598734', 5002),
(102, 'Πλάτων', NULL, 'Λαουρδέκης', 'Μελιγγών', '1', '82286', 'Θεσσαλονίκη', '1965-01-15', 'παντρεμένος', 6, 'Αντρας', '6970117581', 6580),
(103, 'Λάζαρος', 'Διομήδης', 'Αγγελάκος', 'Καλαϊτζοπούλου', '40', '88615', 'Βέροια', '1996-01-15', 'παντρεμένος', 6, 'Αντρας', '6972052103', 2759),
(104, 'Τηλέμαχος', NULL, 'Γκατζογιάννης', 'Πλατεία Σιατίστης', '42', '70803', 'Αθήνα', '1954-01-07', 'ελεύθερος', 0, 'Αντρας', '6971930299', 8595),
(105, 'Μερόπη', NULL, 'Κουμάρα', 'Σπαρτιά', '3', '21158', 'Βέροια', '1942-04-30', 'ελεύθερος', 0, 'Γυναίκα', '6971910976', 8488),
(106, 'Ιωάννης', NULL, 'Γκότσης', 'Αργυρουπόλεως', '26', '23255', 'Βέροια', '1996-12-27', 'παντρεμένος', 2, 'Αντρας', '6973360278', 2930),
(107, 'Κωστούλα', NULL, 'Σπηλιάδου', 'Πλατεία Πευκοχωρίου', '969', '44197', 'Βέροια', '1996-10-09', 'παντρεμένος', 5, 'Γυναίκα', '6973010380', 5284),
(108, 'Παντελία', NULL, 'Δημοπούλου', 'Ξυλοκερατέας', '788-846', '39721', 'Θεσσαλονίκη', '1973-04-27', 'χωρισμένος', 1, 'Γυναίκα', '6971494291', 1285),
(109, 'Λυγερή', NULL, 'Τσακίρη', 'Αγγελώνας', '56', '49425', 'Βέροια', '1976-01-14', 'χωρισμένος', 3, 'Γυναίκα', '6971254100', 3321),
(110, 'Παρθένα', NULL, 'Φαρμάκη', 'Βουνιατάδων', '0', '89660', 'Αθήνα', '1927-10-17', 'χωρισμένος', 0, 'Γυναίκα', '6974564877', 726),
(111, 'Ζαμπέτα', NULL, 'Τσιούπρα', 'Άσπρου', '04-67', '18033', 'Θεσσαλονίκη', '1983-11-02', 'χωρισμένος', 4, 'Γυναίκα', '6971709005', 7146),
(112, 'Θεώνη', NULL, 'Καλαθά', 'Πάρ. Καρποχωρίου', '13', '71073', 'Βέροια', '1970-01-04', 'παντρεμένος', 4, 'Γυναίκα', '6973868527', 6297),
(113, 'Αγαθόνικος', 'Καλλίνικος', 'Στεργιαλής', 'Φρεγκαίνης', '813', '65600', 'Αθήνα', '1972-08-01', 'ελεύθερος', 0, 'Αντρας', '6973816111', 4062),
(114, 'Φωκάς', NULL, 'Κοτσαρής', 'Μπαουσιών', '460-907', '36013', 'Βέροια', '1955-03-03', 'παντρεμένος', 0, 'Αντρας', '6975663088', 3807),
(115, 'Φλώρα', 'Ντανιέλα', 'Σολωμίδου', 'Παπασταύρου', '27-33', '62537', 'Θεσσαλονίκη', '1944-02-06', 'χωρισμένος', 4, 'Γυναίκα', '6975158721', 531),
(116, 'Συμέλα', NULL, 'Μανιτάρου', 'Βουταίνης', '28', '59645', 'Θεσσαλονίκη', '1936-07-11', 'ελεύθερος', 0, 'Γυναίκα', '6973710114', 4781),
(117, 'Αιμιλιανός', NULL, 'Πανούσης', 'Σημάντρου', '64', '97138', 'Θεσσαλονίκη', '1944-02-16', 'χωρισμένος', 4, 'Αντρας', '6979293832', 7407),
(118, 'Δημόκριτος', NULL, 'Ακριώτης', 'Ντριβαλά', '59-90', '78880', 'Θεσσαλονίκη', '2001-11-24', 'ελεύθερος', 0, 'Αντρας', '6977788781', 6669),
(119, 'Γαλάτιος', NULL, 'Φυδάνης', 'Ποτάμων', '45', '38873', 'Βέροια', '1979-09-26', 'ελεύθερος', 0, 'Αντρας', '6976185816', 9446),
(120, 'Σωτήρης', 'Χρύσανθος', 'Κοντογιάννης', 'Λαμποκάμπου', '71-49', '16053', 'Αθήνα', '1965-12-10', 'χωρισμένος', 5, 'Αντρας', '6979823812', 7617),
(121, 'Μαυροειδής', NULL, 'Μανίκας', 'Γεωργανάδων', '3', '48204', 'Θεσσαλονίκη', '1983-02-04', 'παντρεμένος', 6, 'Αντρας', '6974171305', 9304),
(122, 'Βαλεντίνος', 'Σταύρος', 'Περράκης', 'Κλένιας', '76', '66919', 'Βέροια', '1966-11-05', 'χωρισμένος', 4, 'Αντρας', '6976901810', 6448),
(123, 'Βασίλης', NULL, 'Καμποσάκης', 'Τριδένδρου', '69-98', '49789', 'Θεσσαλονίκη', '1946-11-13', 'παντρεμένος', 5, 'Αντρας', '6974790917', 4596),
(124, 'Βύρων', NULL, 'Μπαλάσκας', 'Λεσινίου', '20', '76116', 'Αθήνα', '1973-04-07', 'παντρεμένος', 4, 'Αντρας', '6977343935', 9845),
(125, 'Δαμιανός', NULL, 'Παπαγιαννακόπουλος', 'Μαυρομματίου', '670-773', '40347', 'Βέροια', '1969-03-02', 'παντρεμένος', 5, 'Αντρας', '6979608941', 1887),
(126, 'Λουίζα', 'Αγαθή', 'Μαστρογιαννίδου', 'Βαρνάβα', '51', '10790', 'Αθήνα', '1925-01-01', 'χωρισμένος', 0, 'Γυναίκα', '6975701381', 1897),
(127, 'Θεόφραστος', NULL, 'Κουτσογιάννης', 'Γεωργιάδου', '06', '17580', 'Βέροια', '1942-10-28', 'χωρισμένος', 0, 'Αντρας', '6979065066', 3146),
(128, 'Τρύφων', 'Αλέξανδρος', 'Αγγελάκος', 'Παμφίλων', '97', '60719', 'Αθήνα', '1951-10-10', 'χωρισμένος', 3, 'Αντρας', '6977392665', 60),
(129, 'Αυγή', NULL, 'Δουκίδου', 'Φωτακοπούλου', '3', '71320', 'Αθήνα', '1932-09-28', 'παντρεμένος', 4, 'Γυναίκα', '6974043465', 7987),
(130, 'Βάγια', NULL, 'Μιχαλάρου', 'Πάροδος Αλευρούς', '47', '64713', 'Θεσσαλονίκη', '1920-10-23', 'ελεύθερος', 0, 'Γυναίκα', '6975382978', 729),
(131, 'Συμέλα', NULL, 'Καραμάνη', 'Φρονιμάκη', '72', '22836', 'Αθήνα', '1954-01-30', 'χωρισμένος', 5, 'Γυναίκα', '6976567811', 9481),
(132, 'Χάρις', NULL, 'Κουτσούρας', 'Μωυσίδου', '00', '43256', 'Βέροια', '1950-03-28', 'παντρεμένος', 3, 'Αντρας', '6974849741', 8988),
(133, 'Θουκυδίδης', NULL, 'Κουλίζος', 'Βρυσικών', '3', '15713', 'Θεσσαλονίκη', '1986-02-14', 'χωρισμένος', 2, 'Αντρας', '6970587164', 8016),
(134, 'Ελευθέριος', NULL, 'Χατζηκύρκος', 'Σκούρας', '70', '46166', 'Θεσσαλονίκη', '1978-08-18', 'ελεύθερος', 0, 'Αντρας', '6970908464', 8770),
(135, 'Χαραλαμπία', NULL, 'Πατελλή', 'Χατζημιχαήλ', '47', '62282', 'Αθήνα', '1972-03-12', 'ελεύθερος', 0, 'Γυναίκα', '6972171747', 4978),
(136, 'Αρτεμισία', NULL, 'Συμεωνίδου', 'Δαιμονίας', '3', '34443', 'Θεσσαλονίκη', '1932-12-31', 'χωρισμένος', 3, 'Γυναίκα', '6970232028', 5906),
(137, 'Ασημάκης', NULL, 'Δόσης', 'Πάροδος Ιωαννίνων', '09', '66740', 'Θεσσαλονίκη', '1990-12-13', 'χωρισμένος', 6, 'Αντρας', '6974353088', 38),
(138, 'Θεόκλητος', 'Αριστομένης', 'Αγγελίδης', 'Χανδρά', '5', '49104', 'Αθήνα', '1954-06-27', 'χωρισμένος', 4, 'Αντρας', '6979023384', 7057),
(139, 'Κλεόπας', NULL, 'Κοτσαρής', 'Πάροδος Συκιάδας', '67-47', '88672', 'Αθήνα', '1972-06-24', 'ελεύθερος', 0, 'Αντρας', '6975962237', 7629),
(140, 'Παγώνα', NULL, 'Μπότζα', 'Πιραμάς', '72-38', '85106', 'Αθήνα', '2002-04-17', 'χωρισμένος', 6, 'Γυναίκα', '6970556784', 4628),
(141, 'Συμεωνία', NULL, 'Αργυροπούλου', 'Κουρκουλών', '092-756', '79588', 'Θεσσαλονίκη', '1966-03-01', 'παντρεμένος', 0, 'Γυναίκα', '6975586557', 4487),
(142, 'Φωτεινός', NULL, 'Ευαγγελάτος', 'Χουμνικού', '3', '55241', 'Αθήνα', '1984-12-26', 'παντρεμένος', 2, 'Αντρας', '6977241287', 8595),
(143, 'Χριστόφιλη', NULL, 'Μαγκαφοπούλου', 'Σηκωτίδου', '207-957', '29581', 'Βέροια', '1923-09-06', 'παντρεμένος', 6, 'Γυναίκα', '6974795524', 1135),
(144, 'Σάββας', NULL, 'Τσούμος', 'Γιαννακοχωρίου', '19', '33961', 'Θεσσαλονίκη', '1973-04-29', 'ελεύθερος', 0, 'Αντρας', '6979398116', 4122),
(145, 'Έκτορας', NULL, 'Μανωλέας', 'Προφήτης Ηλίας', '5', '61757', 'Βέροια', '1949-09-30', 'χωρισμένος', 1, 'Αντρας', '6971550764', 4891),
(146, 'Μελίνα', NULL, 'Στρούμπα', 'Πέτση', '802-563', '70369', 'Βέροια', '2001-07-31', 'χωρισμένος', 1, 'Γυναίκα', '6971335526', 7588),
(147, 'Ντανιέλα', 'Υπαπαντή', 'Φειζατίδου', 'Λεωφόρος Κυπαρισσίου', '492-277', '39241', 'Βέροια', '2001-03-25', 'παντρεμένος', 0, 'Γυναίκα', '6973577170', 3428),
(148, 'Ροδιά', NULL, 'Κολαΐτου', 'Υπερείας', '73', '91204', 'Αθήνα', '1934-03-23', 'παντρεμένος', 4, 'Γυναίκα', '6975627904', 2070),
(149, 'Όθων', 'Φανούριος', 'Σαμανίδης', 'Αγίου Νικολάου Μονεμβασίας', '8', '98998', 'Αθήνα', '1985-09-21', 'χωρισμένος', 4, 'Αντρας', '6976395551', 766),
(150, 'Κλέαρχος', NULL, 'Μανωλάκης', 'Αλτομιρών', '1', '56871', 'Αθήνα', '1937-10-19', 'χωρισμένος', 6, 'Αντρας', '6976171533', 4271),
(151, 'Γενοβέφα', NULL, 'Χρήστου', 'Προδρομίου', '845-676', '40968', 'Θεσσαλονίκη', '1989-11-06', 'ελεύθερος', 0, 'Γυναίκα', '6970220616', 2136),
(152, 'Πωλίνα', 'Ευσεβεία', 'Παπαθωμά', 'Βάθης', '63', '40698', 'Βέροια', '1997-06-29', 'ελεύθερος', 0, 'Γυναίκα', '6974477061', 4178),
(153, 'Χρυσή', NULL, 'Μοσχοβάκη', 'Κρήνης Αιγιαλείας', '4', '25630', 'Αθήνα', '1978-07-27', 'ελεύθερος', 0, 'Γυναίκα', '6970069078', 4011),
(154, 'Αριστέα', NULL, 'Ζώη', 'Χουμνικού', '727', '14493', 'Θεσσαλονίκη', '1958-10-08', 'χωρισμένος', 0, 'Γυναίκα', '6972611249', 1745),
(155, 'Νεόφυτος', NULL, 'Παναγιωτακόπουλος', 'Κλείτου', '81', '88443', 'Αθήνα', '1956-10-07', 'ελεύθερος', 0, 'Αντρας', '6979160597', 3151),
(156, 'Χριστοδούλα', NULL, 'Δαμαλά', 'Λεωφόρος Σελλά', '9', '20657', 'Βέροια', '1971-12-23', 'ελεύθερος', 0, 'Γυναίκα', '6971121584', 3878),
(157, 'Ζήνων', NULL, 'Σιτόπουλος', 'Λεωφόρος Ποτάμων', '809-085', '25665', 'Θεσσαλονίκη', '1961-10-28', 'χωρισμένος', 6, 'Αντρας', '6978441471', 493),
(158, 'Αταλάντη', NULL, 'Τσιούπρα', 'Βραχναιίκων', '18-91', '66525', 'Βέροια', '1985-12-18', 'παντρεμένος', 4, 'Γυναίκα', '6971593440', 1872),
(159, 'Νίκων', 'Εφραίμ', 'Καραγιάννης', 'Παπανάνου', '93', '79704', 'Θεσσαλονίκη', '1956-01-24', 'ελεύθερος', 0, 'Αντρας', '6979589065', 7558),
(160, 'Κώστας', NULL, 'Κραββαρίτης', 'Σάμης', '112-827', '76204', 'Βέροια', '1924-08-01', 'παντρεμένος', 4, 'Αντρας', '6979310606', 6167),
(161, 'Χρυσοβαλάντω', NULL, 'Τσουνάκου', 'Μαζαρακίου', '6', '72492', 'Βέροια', '1945-10-20', 'παντρεμένος', 6, 'Γυναίκα', '6972428965', 9248),
(162, 'Δόμνα', NULL, 'Πέτρου', 'Λεωφ. Περίου', '2', '70911', 'Βέροια', '1975-07-25', 'παντρεμένος', 4, 'Γυναίκα', '6972124070', 3509),
(163, 'Βενιαμίν', NULL, 'Σουρμπής', 'Τσιομπάνη', '00', '41389', 'Θεσσαλονίκη', '1955-11-11', 'χωρισμένος', 3, 'Αντρας', '6974634068', 6025),
(164, 'Λαέρτης', NULL, 'Μάνδαλος', 'Ανδρωνιάνων', '59', '34953', 'Αθήνα', '1938-06-03', 'ελεύθερος', 0, 'Αντρας', '6972217078', 5220),
(165, 'Άνθιμος', 'Βλαδίμηρος', 'Κονδυλίδης', 'Μοίρας', '073-820', '89873', 'Αθήνα', '1941-12-14', 'ελεύθερος', 0, 'Αντρας', '6979099303', 1520),
(166, 'Δομήνικος', 'Εφραίμ', 'Μάνδαλος', 'Σάρτης', '43', '42350', 'Αθήνα', '1970-08-19', 'παντρεμένος', 1, 'Αντρας', '6973577750', 4857),
(167, 'Ακρίτας', NULL, 'Νανούρης', 'Πόρπη', '9', '21027', 'Αθήνα', '1996-04-19', 'χωρισμένος', 6, 'Αντρας', '6972383703', 1200),
(168, 'Λάμπρος', NULL, 'Βαμβακάς', 'Πάρ. Παρτίρων', '8', '79269', 'Θεσσαλονίκη', '1926-03-15', 'παντρεμένος', 3, 'Αντρας', '6979783037', 549),
(169, 'Ευγένιος', NULL, 'Αμπλιάνιτης', 'Λαλαούνη', '62-26', '47755', 'Θεσσαλονίκη', '1938-12-15', 'χωρισμένος', 1, 'Αντρας', '6974555440', 1184),
(170, 'Εριέτα', NULL, 'Ιωσηφίδου', 'Φλατσίων', '4', '37674', 'Βέροια', '1958-06-24', 'παντρεμένος', 0, 'Γυναίκα', '6978446030', 1771),
(171, 'Σεβαστή', NULL, 'Καφφέ', 'Στρυμονικού', '651', '38313', 'Αθήνα', '1942-05-05', 'χωρισμένος', 0, 'Γυναίκα', '6972712505', 6475),
(172, 'Πολυνίκη', NULL, 'Τσιομπάνη', 'Βουλτσίδου', '21', '63164', 'Θεσσαλονίκη', '1997-04-30', 'ελεύθερος', 0, 'Γυναίκα', '6979590702', 5083),
(173, 'Γιασεμή', NULL, 'Παπασταύρου', 'Ξενίδη', '189-301', '34704', 'Αθήνα', '1945-11-30', 'ελεύθερος', 0, 'Γυναίκα', '6972274715', 8346),
(174, 'Τίτος', NULL, 'Βαρακλής', 'Φλογητών', '83', '91945', 'Βέροια', '1995-03-16', 'χωρισμένος', 5, 'Αντρας', '6979120249', 4850),
(175, 'Μαργιέττα', NULL, 'Μέλανι', 'Στρουσίου', '18', '83432', 'Αθήνα', '1924-10-02', 'παντρεμένος', 4, 'Γυναίκα', '6975461754', 6062),
(176, 'Ιερώνυμος', NULL, 'Μποφός', 'Στενού', '9', '76667', 'Βέροια', '1940-03-18', 'παντρεμένος', 5, 'Αντρας', '6979028114', 4099),
(177, 'Ευτυχία', NULL, 'Πατσουρέα', 'Πλατεία Κατταβίας', '655', '52068', 'Βέροια', '1920-09-12', 'χωρισμένος', 2, 'Γυναίκα', '6970243119', 6052),
(178, 'Διονυσία', NULL, 'Κοτσινά', 'Βουνοπλαγιάς', '78', '28269', 'Βέροια', '1955-11-16', 'παντρεμένος', 0, 'Γυναίκα', '6975667000', 9479),
(179, 'Χριστόφορος', NULL, 'Περράκης', 'Μυξόρρουμα', '2', '85654', 'Θεσσαλονίκη', '1968-08-14', 'ελεύθερος', 0, 'Αντρας', '6979429591', 3422),
(180, 'Πάρις', 'Κοσμάς', 'Γκιτσάκης', 'Γαλατάδων', '6', '97585', 'Θεσσαλονίκη', '1931-06-20', 'ελεύθερος', 0, 'Αντρας', '6970869941', 9976),
(181, 'Αθανάσιος', NULL, 'Συργής', 'Λεωφόρος Βουρλιωτών', '226', '99455', 'Βέροια', '1956-10-13', 'ελεύθερος', 0, 'Αντρας', '6976876973', 3388),
(182, 'Θηρεσία', 'Κυπαρισσία', 'Ρούσσου', 'Γιουργάνιστας', '8', '30947', 'Βέροια', '1943-08-18', 'ελεύθερος', 0, 'Γυναίκα', '6974366720', 5915),
(183, 'Ιωάννα', NULL, 'Φωτιάδου', 'Ρυζιών', '3', '74882', 'Αθήνα', '1956-12-18', 'χωρισμένος', 3, 'Γυναίκα', '6975638593', 1078),
(184, 'Διδώ', NULL, 'Στρούμπα', 'Κωνσταντίνων', '41', '86829', 'Βέροια', '1922-10-07', 'ελεύθερος', 0, 'Γυναίκα', '6974205583', 6790),
(185, 'Γλαύκη', NULL, 'Μπιμπίκα', 'Αιαντείου', '93', '48862', 'Θεσσαλονίκη', '1948-03-05', 'ελεύθερος', 0, 'Γυναίκα', '6978995232', 8088),
(186, 'Γαλάτιος', NULL, 'Καλαργυρός', 'Γλυκόβρυσης', '892-635', '12773', 'Θεσσαλονίκη', '1934-06-08', 'χωρισμένος', 1, 'Αντρας', '6979520168', 852),
(187, 'Ναυσικά', NULL, 'Μανουσοπούλου', 'Κορησσίας', '8', '16123', 'Θεσσαλονίκη', '1926-01-05', 'χωρισμένος', 5, 'Γυναίκα', '6970340880', 3989),
(188, 'Λαοκράτης', NULL, 'Κατάκης', 'Βροντισμένης', '154', '29340', 'Αθήνα', '1963-03-25', 'παντρεμένος', 5, 'Αντρας', '6972723347', 391),
(189, 'Αχιλλεία', 'Μαργιέττα', 'Βλαχοδήμου', 'Βαγενά', '81', '93254', 'Θεσσαλονίκη', '1972-04-08', 'παντρεμένος', 0, 'Γυναίκα', '6972427892', 7398),
(190, 'Αριστοτέλης', NULL, 'Σπανός', 'Τζαναβάρα', '560-714', '12308', 'Αθήνα', '1954-06-06', 'ελεύθερος', 0, 'Αντρας', '6975369334', 728),
(191, 'Κονδυλία', NULL, 'Τσαμοπούλου', 'Φραντζή', '2', '30163', 'Βέροια', '2000-11-21', 'παντρεμένος', 0, 'Γυναίκα', '6975841194', 9006),
(192, 'Ρέα', NULL, 'Βασιλοπούλου', 'Βερμίου', '4', '86233', 'Βέροια', '1950-08-19', 'ελεύθερος', 0, 'Γυναίκα', '6972160963', 5197),
(193, 'Κορνηλία', NULL, 'Γρηγοριάδου', 'Σπαρτιατών', '81', '54109', 'Βέροια', '2000-07-14', 'ελεύθερος', 0, 'Γυναίκα', '6975939695', 3184),
(194, 'Πύρρος', NULL, 'Ραχμανίδης', 'Καππαδοκικού', '87', '62363', 'Αθήνα', '1970-08-25', 'ελεύθερος', 0, 'Αντρας', '6975995965', 8670),
(195, 'Ανθούλης', 'Σπυρίδων', 'Βιολάτος', 'Ποταμιάνου', '75', '36265', 'Βέροια', '1988-07-12', 'χωρισμένος', 1, 'Αντρας', '6976848349', 6884),
(196, 'Λάμπρος', NULL, 'Σαουλίδης', 'Σουληναρίου', '7', '94186', 'Βέροια', '1921-04-02', 'χωρισμένος', 5, 'Αντρας', '6972561966', 3950),
(197, 'Θεοδόσης', NULL, 'Βαχουθιανάκης', 'Λεωφ. Πηγαδούλια', '85', '66818', 'Βέροια', '1921-04-04', 'ελεύθερος', 0, 'Αντρας', '6979402233', 6448),
(198, 'Δημόκριτος', NULL, 'Μάστορας', 'Πάροδος Χορτιάτη', '657-757', '74314', 'Βέροια', '1942-09-18', 'χωρισμένος', 6, 'Αντρας', '6971523893', 6246),
(199, 'Χριστοφόρα', NULL, 'Καζαντζή', 'Χωρίου Κυδωνίας', '20', '84913', 'Θεσσαλονίκη', '1980-08-08', 'παντρεμένος', 6, 'Γυναίκα', '6973465568', 2033),
(200, 'Πολυχρόνιος', NULL, 'Χουδαλάκης', 'Πάροδος Λυκόγιαννης', '26', '89302', 'Θεσσαλονίκη', '1980-04-11', 'χωρισμένος', 3, 'Αντρας', '6971422802', 5127);

-- --------------------------------------------------------

--
-- Table structure for table `has`
--

CREATE TABLE `has` (
  `product_id` int(11) NOT NULL,
  `store_id` int(11) NOT NULL,
  `stored_quantity` int(11) NOT NULL,
  `aisle` int(11) NOT NULL,
  `shelve` int(11) NOT NULL,
  `current_price` int(11) NOT NULL,
  `has_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `made_by`
--

CREATE TABLE `made_by` (
  `card_id` int(11) NOT NULL,
  `transaction_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `price_log`
--

CREATE TABLE `price_log` (
  `price_log_id` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `value` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `store_brand` tinyint(1) NOT NULL DEFAULT 0,
  `category` varchar(30) NOT NULL,
  `product_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`product_id`, `store_brand`, `category`, `product_name`) VALUES
(88, 1, 'Φρέσκα Προϊόντα', 'Τομάτες Χύμα Ελληνικές'),
(89, 0, 'Φρέσκα Προϊόντα', 'Κολοκύθια Ελληνικά'),
(90, 0, 'Φρέσκα Προϊόντα', 'Καρότα Χύμα Ελληνικά'),
(91, 1, 'Φρέσκα Προϊόντα', 'Μπανάνες Cavendish Εισαγωγής'),
(92, 1, 'Φρέσκα Προϊόντα', 'Πατάτες Κύπρου Συσκευασμένες'),
(93, 0, 'Φρέσκα Προϊόντα', 'Πιπεριές Πράσινες'),
(94, 1, 'Φρέσκα Προϊόντα', 'Μήλα Σταρλινγκ Ελληνικά'),
(95, 0, 'Φρέσκα Προϊόντα', 'Κρεμμύδια Ξερά Χοντρά Συσκευασμένα'),
(96, 1, 'Φρέσκα Προϊόντα', 'Πορτοκάλια Βαλέντσια Χυμού Ελληνικά'),
(97, 0, 'Φρέσκα Προϊόντα', 'Μπρόκολο Πράσινο Ελληνικό'),
(98, 1, 'Φρέσκα Προϊόντα', 'Λεμόνια Χυμού'),
(99, 0, 'Φρέσκα Προϊόντα', 'Πράσσα Ελληνικά'),
(100, 0, 'Φρέσκα Προϊόντα', 'Φράουλες Συσκευασμένες Ελληνικές'),
(101, 1, 'Φρέσκα Προϊόντα', 'Ανανάς DOLE'),
(102, 0, 'Είδη Ψυγείου', 'Φρέσκο Γάλα Μεβγάλ 2%'),
(103, 0, 'Είδη Ψυγείου', 'Φυσικός Χυμός Πορτοκάλι Όλυμπος'),
(104, 0, 'Είδη Ψυγείου', 'Σαρδέλες Κατεψυγμένες Τράτα'),
(105, 0, 'Είδη Ψυγείου', 'Πέρκα Φιλέτο Καλλιμάνης'),
(106, 0, 'Είδη Ψυγείου', 'Αρακάς Κατεψυγμένος Μπαρμπα Στάθης'),
(107, 1, 'Είδη Ψυγείου', 'Ψαροκροκέτες IGLO'),
(108, 1, 'Είδη Ψυγείου', 'Παναρισμένες Κοτομπουκιές Υφαντής'),
(109, 1, 'Είδη Ψυγείου', 'Φιλετάκια Κοτόπουλο Ψητά Υφαντής'),
(110, 1, 'Είδη Ψυγείου', 'Παγωτό Βανίλια 1Kg 365'),
(111, 1, 'Είδη Ψυγείου', 'Κατεψυγμένη Πίτσα Μαργαρίτα Χρυσή Ζύμη'),
(112, 1, 'Είδη Ψυγείου', 'Γιαούρτι Στραγγιστό 3% Total'),
(113, 1, 'Είδη Ψυγείου', 'Γιαούρτι Στραγγιστό 1Kg Δωδώνη'),
(114, 0, 'Είδη Κάβας', 'Absolut Vodka'),
(115, 1, 'Είδη Κάβας', 'Belvedere Vodka'),
(116, 0, 'Είδη Κάβας', 'Greygoose'),
(117, 1, 'Είδη Κάβας', 'Amita Motion'),
(118, 0, 'Είδη Κάβας', 'Mojito'),
(119, 1, 'Είδη Κάβας', 'Campari'),
(120, 0, 'Είδη Κάβας', 'Jack Daniels Single Barrel'),
(121, 0, 'Είδη Κάβας', 'Lagavulin 16 Year Old'),
(122, 1, 'Είδη Κάβας', 'Talisker'),
(123, 0, 'Είδη Κάβας', 'Κτήμα Μπαραφάκα Τρείς Μάγισσες Ροζέ'),
(124, 0, 'Είδη Κάβας', 'Santo Wines Vinsanto Λευκό'),
(125, 0, 'Είδη Κάβας', 'Κτήμα Κώστα Λαζαρίδη Domaine Costa Lazaridi Merlot Ροζέ'),
(126, 1, 'Είδη Κάβας', 'Martini Asti Λευκό'),
(127, 0, 'Είδη Κάβας', 'Moet & Chandon Brut Imperial Λευκό'),
(128, 0, 'Είδη Κάβας', 'Dom Pérignon Brut Λευκό'),
(129, 1, 'Είδη Κάβας', 'Χίου Φιάλη'),
(130, 0, 'Είδη Κάβας', 'Corona'),
(131, 0, 'Είδη Κάβας', 'Χίου Smoked Robust Porter'),
(132, 1, 'Είδη Προσωπικής Περιποίησης', 'Ξυραφάκι Gillet'),
(133, 1, 'Είδη Προσωπικής Περιποίησης', 'Μάσκα Ομορφιάς'),
(134, 1, 'Είδη Προσωπικής Περιποίησης', 'Αποτριχωτική κρέμα προσώπου'),
(135, 0, 'Είδη Προσωπικής Περιποίησης', 'La Roche Posay Hyalu B5 Serum 30ml'),
(136, 1, 'Είδη Προσωπικής Περιποίησης', 'Vichy Mineral 89 Hyaluronic Acid Face Moisturizer 50ml'),
(137, 0, 'Είδη Προσωπικής Περιποίησης', 'La Roche Posay Effaclar Purifying Cleansing Gel Pump 400ml'),
(138, 1, 'Είδη Προσωπικής Περιποίησης', 'Proraso Beard OIl Wood & Spice 30ml'),
(139, 1, 'Είδη Προσωπικής Περιποίησης', 'LOreal Men Expert BarberClub Long Beard & Skil Oil 30ml'),
(140, 1, 'Είδη Προσωπικής Περιποίησης', 'Morgans Moustache & Beard Cream 75ml'),
(141, 1, 'Είδη Προσωπικής Περιποίησης', 'Apivita Face Scrub Βαθιάς Απολέπισης με Ελιά 50ml'),
(142, 1, 'Είδη Προσωπικής Περιποίησης', 'Bluebeards Revenge Cut-Throat Shavette'),
(143, 0, 'Είδη Προσωπικής Περιποίησης', 'Eurostil Ξυράφι Barber'),
(144, 1, 'Είδη Σπιτιού', 'Durostick Όξινο καθαριστικό πλακιδίων Υγρό 1000ml'),
(145, 1, 'Είδη Σπιτιού', 'Chios Hellas Σίτα Πόρτας Μαγνητική 120x220cm KO121'),
(146, 1, 'Είδη Σπιτιού', 'Dettol All In One Crisp Linen Απολυμαντικό Spray 400ml'),
(147, 0, 'Είδη Σπιτιού', 'Klinex 4 σε 1 Λεμόνι Απολυμαντικό Spray 750ml'),
(148, 0, 'Είδη Σπιτιού', 'Baby Planet Απολυμαντικό Spray 325ml'),
(149, 0, 'Είδη Σπιτιού', 'Dettol Power & Fresh Green Apple 40 μαντηλάκια'),
(150, 0, 'Είδη Σπιτιού', 'Topine Plus Red Pine Απολυμαντικό Υγρό 1000ml'),
(151, 0, 'Είδη Σπιτιού', 'Wpro IXC127 Κρέμα 250ml'),
(152, 0, 'Είδη Σπιτιού', 'Swaz Υγρό 1000ml'),
(153, 0, 'Είδη Σπιτιού', 'Cif Κρέμα 500ml'),
(154, 0, 'Είδη Σπιτιού', 'Klinex 4 σε 1 Κουζίνα Απολυμαντικό Spray 750ml'),
(155, 1, 'Είδη Σπιτιού', 'New Line Blue Line Υγρό 1000ml'),
(156, 1, 'Προϊόντα για Κατοικίδια', 'PetSafe Simply Clean Αυτόματη Τουαλέτα Γάτας'),
(157, 0, 'Προϊόντα για Κατοικίδια', 'PetTrainer Κολάρο Γαυγίσματος '),
(158, 1, 'Προϊόντα για Κατοικίδια', 'PetTrainer Αντιπαρασιτικό Κολάρο για Κατοικίδια'),
(159, 1, 'Προϊόντα για Κατοικίδια', 'Κλουβί Rico Χρυσό Δ. 40 x 70 cm'),
(160, 1, 'Προϊόντα για Κατοικίδια', 'Κλουβί Lorita 59 x 59 x 1.50cm'),
(161, 1, 'Προϊόντα για Κατοικίδια', 'Sonar Pet Dog Cat Clipper Trimmer'),
(162, 0, 'Προϊόντα για Κατοικίδια', 'Wahl Pet Model Lithium Pro'),
(163, 1, 'Προϊόντα για Κατοικίδια', 'Ενυδρείο HS Aqua Full-Glass'),
(164, 0, 'Προϊόντα για Κατοικίδια', 'Τροφή Τροπικών Ψαριών Weekend για 2-4 Μέρες 4 τεμ'),
(165, 0, 'Προϊόντα για Κατοικίδια', 'ΨΑΡΟΤΡΟΦΗ TRIXIE 2 ΕΒΔΟΜΑΔΩΝ'),
(166, 1, 'Προϊόντα για Κατοικίδια', 'Versele Laga Prestige Τροφη Μεσαιων Παπαγαλων 1kg'),
(167, 0, 'Προϊόντα για Κατοικίδια', 'Manitoba Canary Best Premium 1 Kg'),
(168, 1, 'Προϊόντα για Κατοικίδια', 'Snacks επιβράβευσης Mini Hearts 200gr Trixie'),
(169, 1, 'Προϊόντα για Κατοικίδια', 'PEDIGREE TASTY MINIS JUNIOR ΜΕ ΚΟΤΟΠΟΥΛΟ 125G'),
(170, 1, 'Προϊόντα για Κατοικίδια', 'Ονυχοδρόμιο γάτας σκρατς 36x19x4cm'),
(171, 1, 'Προϊόντα για Κατοικίδια', 'Royal Canin Sterilised 37 4kg'),
(172, 0, 'Προϊόντα για Κατοικίδια', 'ΛΙΧΟΥΔΙΑ MILKIES ANIMONDA ΓΙΑ ΓΑΤΕΣ - 15gr'),
(173, 1, 'Προϊόντα για Κατοικίδια', 'Τουαλέτα Γάτας Κλειστή 41.8x50.5x39.6cm RATTAN'),
(174, 0, 'Προϊόντα για Κατοικίδια', 'Γατόδεντρο-ονυχοδρόμιο mars 170cm');

-- --------------------------------------------------------

--
-- Table structure for table `store`
--

CREATE TABLE `store` (
  `store_id` int(11) NOT NULL,
  `store_area` int(11) NOT NULL,
  `operating_hours` text NOT NULL,
  `street` varchar(50) NOT NULL,
  `number` varchar(10) NOT NULL,
  `zip` varchar(10) NOT NULL,
  `city` varchar(50) NOT NULL,
  `phone_number` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `store`
--

INSERT INTO `store` (`store_id`, `store_area`, `operating_hours`, `street`, `number`, `zip`, `city`, `phone_number`) VALUES
(1, 230, '8:00 - 20:00', 'Λεωφόρος Παπάγου', '28', '15773', 'Αθήνα', '2103477845'),
(2, 500, '8:00 - 20:00', 'Κειριαδών', '53', '11853', 'Αθήνα', '2103474744'),
(3, 669, '8:00 - 20:00', 'Ροδοπόλεως', '57', '18451', 'Αθήνα', '2100151569'),
(4, 1000, '8:00 - 20:00', 'Τσιμισκή', '45', '11515', 'Θεσσαλονίκη', '2310556698'),
(5, 600, '8:00 - 20:00', 'Αρμάτων', '92', '24196', 'Θεσσαλονίκη', '2542315166'),
(6, 420, '8:00 - 20:00', 'Αντικυθήρων', '69', '98444', 'Αθήνα', '2103558897'),
(7, 830, '8:00 - 20:00', 'Νεροκούρου', '7', '32608', 'Βέροια', '2222522555'),
(8, 430, '8:00 - 20:00', 'Λαλαούνη', '42', '75886', 'Βέροια', '2156416555'),
(9, 700, '8:00 - 20:00', 'Αλέας', '1', '64844', 'Θεσσαλονίκη', '2310542098'),
(10, 666, '8:00 - 20:00', 'Πλατεία Καμενίτσης', '85', '40633', 'Αθήνα', '2107723393');

-- --------------------------------------------------------

--
-- Table structure for table `transaction`
--

CREATE TABLE `transaction` (
  `transaction_id` int(11) NOT NULL,
  `date_time` datetime NOT NULL,
  `total_cost` int(10) UNSIGNED NOT NULL,
  `payment_type` varchar(10) NOT NULL,
  `total_items_bought` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `at`
--
ALTER TABLE `at`
  ADD KEY `store_id` (`store_id`),
  ADD KEY `transaction_id` (`transaction_id`);

--
-- Indexes for table `contains`
--
ALTER TABLE `contains`
  ADD KEY `contains_ibfk_1` (`product_id`),
  ADD KEY `transaction_id` (`transaction_id`);

--
-- Indexes for table `customer`
--
ALTER TABLE `customer`
  ADD PRIMARY KEY (`card_id`);

--
-- Indexes for table `has`
--
ALTER TABLE `has`
  ADD PRIMARY KEY (`has_id`),
  ADD KEY `product_id` (`product_id`),
  ADD KEY `store_id` (`store_id`);

--
-- Indexes for table `made_by`
--
ALTER TABLE `made_by`
  ADD KEY `card_id` (`card_id`),
  ADD KEY `transaction_id` (`transaction_id`);

--
-- Indexes for table `price_log`
--
ALTER TABLE `price_log`
  ADD PRIMARY KEY (`price_log_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- Indexes for table `store`
--
ALTER TABLE `store`
  ADD PRIMARY KEY (`store_id`);

--
-- Indexes for table `transaction`
--
ALTER TABLE `transaction`
  ADD PRIMARY KEY (`transaction_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `customer`
--
ALTER TABLE `customer`
  MODIFY `card_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=201;

--
-- AUTO_INCREMENT for table `has`
--
ALTER TABLE `has`
  MODIFY `has_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `price_log`
--
ALTER TABLE `price_log`
  MODIFY `price_log_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=175;

--
-- AUTO_INCREMENT for table `store`
--
ALTER TABLE `store`
  MODIFY `store_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `transaction`
--
ALTER TABLE `transaction`
  MODIFY `transaction_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `at`
--
ALTER TABLE `at`
  ADD CONSTRAINT `at_ibfk_1` FOREIGN KEY (`store_id`) REFERENCES `store` (`store_id`) ON DELETE NO ACTION ON UPDATE CASCADE,
  ADD CONSTRAINT `at_ibfk_2` FOREIGN KEY (`transaction_id`) REFERENCES `transaction` (`transaction_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `contains`
--
ALTER TABLE `contains`
  ADD CONSTRAINT `contains_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `products` (`product_id`) ON DELETE NO ACTION ON UPDATE CASCADE,
  ADD CONSTRAINT `contains_ibfk_2` FOREIGN KEY (`transaction_id`) REFERENCES `transaction` (`transaction_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `has`
--
ALTER TABLE `has`
  ADD CONSTRAINT `has_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `products` (`product_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `has_ibfk_2` FOREIGN KEY (`store_id`) REFERENCES `store` (`store_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `made_by`
--
ALTER TABLE `made_by`
  ADD CONSTRAINT `made_by_ibfk_1` FOREIGN KEY (`card_id`) REFERENCES `customer` (`card_id`) ON DELETE NO ACTION ON UPDATE CASCADE,
  ADD CONSTRAINT `made_by_ibfk_2` FOREIGN KEY (`transaction_id`) REFERENCES `transaction` (`transaction_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `price_log`
--
ALTER TABLE `price_log`
  ADD CONSTRAINT `price_log_ibfk_1` FOREIGN KEY (`price_log_id`) REFERENCES `has` (`has_id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
